In [2]:
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt
import warnings
warnings.filterwarnings('ignore')
from sklearn.preprocessing import OrdinalEncoder

In [3]:
df = pd.read_csv('../Book1.csv')

df.head()

,gender,age,f-edu,m-edu,income,event,duration,p1,p2,p3,...,c1,c2,c3,c4,c5,e1,e2,e3,e4,e5
0,Male,22,College,High School,"21,194 - 43,828",1,31,4,4,3,...,2,2,2,2,3,1,2,2,2,2
1,Male,23,College,College,"43,828 - 76,669",0,40,5,5,4,...,5,5,3,5,5,5,5,5,5,5
2,Male,19,College,High School,"43,828 - 76,669",1,15,1,2,2,...,2,2,1,2,1,5,5,5,5,5
3,Male,24,High School,Elementary,"21,194 - 43,828",0,40,1,5,4,...,3,3,2,4,5,2,3,4,1,5
4,Male,19,High School,College,"21,194 - 43,828",1,4,3,4,4,...,1,1,2,4,4,2,2,2,2,2

In [4]:
male_drop, male_not_drop = len(df.gender[df.gender == 'Male'][df.event == 1]), len(df.gender[df.gender == 'Male'][df.event == 0]),
female_drop, female_not_drop =  len(df.gender[df.gender == 'Female'][df.event == 1]), len(df.gender[df.gender == 'Female'][df.event == 0])

total_male = male_drop + male_not_drop
total_female = female_drop + female_not_drop

percentage_of_male_dropout = (male_drop/total_male) * 100
percentage_of_male_not_dropout = (male_not_drop/total_male) * 100
percentage_of_female_dropout = (female_drop/total_female) * 100
percentage_of_female_not_dropout = (female_not_drop/total_female) * 100

confusion_df = pd.DataFrame(index=['Male', 'Female'])
confusion_df['Yes'] = [f'{male_drop} ({round(percentage_of_male_dropout, 2)}%)', f'{female_drop}({round(percentage_of_female_dropout, 2)}%)']
confusion_df['No'] = [f'{male_not_drop} ({round(percentage_of_male_not_dropout, 2)}%)', f'{female_not_drop} ({round(percentage_of_female_not_dropout, 2)}%)']
confusion_df.to_csv('confusion matrix of sex and event.csv') 
confusion_df

                Yes            No
Male    42 (27.45%)  111 (72.55%)
Female    21(9.81%)  193 (90.19%)

In [13]:
df[['income','event']][df.event == 1].groupby(['income']).count()

                     event
income
 131,484 -  219,140      1
 21,194 -  43,828       16
 43,828 -  76,669        1
 9,520 to  21,194       14
Less than  9,520        31